# YOLOv8 sparse backbone variant: all backbone downsampling Conv layers are sparse.

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, SparseConv, [64, 3, 2]]
  - [-1, 1, SparseConv, [128, 3, 2]]
  - [-1, 3, C2f, [128, true]]
  - [-1, 1, SparseConv, [256, 3, 2]]
  - [-1, 6, C2f, [256, true]]
  - [-1, 1, SparseConv, [512, 3, 2]]
  - [-1, 6, C2f, [512, true]]
  - [-1, 1, SparseConv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, true]]
  - [-1, 1, SPPF, [1024, 5]]

head:
  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [null, 2, nearest]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[15, 18, 21], 1, Detect, [nc]]
